# MySQL Tutorial

In [5]:
import mysql.connector

In [6]:
new_db = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = 'gateway666'
)

print(new_db)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001E6E6663110>

## Creating a Database

In [ ]:
#creating a cursor function
#it helps to create and fetch data from the database
new_cursor = new_db.cursor()

#create database call newData using the execute function
new_cursor.execute('CREATE DATABASE newData')

#### method 1 - using MySQL Workbench

#### method 2 - checking if dataBase exist

In [10]:
#checking if dataBase exist or not
new_cursor.execute('SHOW DATABASES')
for n in new_cursor:
    print(n)

('information_schema',)
('mysql',)
('newdata',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

#### method 3 - checking if dataBase exist

In [12]:
new_db = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = 'gateway666',
    database = 'newData'
)

print(new_db)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001E6E6F966D0>

## Creating Tables and Showing Data

In [17]:
import mysql.connector

new_db = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = 'gateway666',
    database = 'newdata'
)

new_cursor = new_db.cursor()

#name of table is students 
#table has two columns, name and code
#VARCHAR is one of the many data types in MySQL
new_cursor.execute('CREATE TABLE students (name VARCHAR(255), code VARCHAR(255))')

#### List all tables in newData database

In [18]:
new_cursor.execute('SHOW TABLES')
for x in new_cursor:
    print(x)

('students',)

There is only one table shown above and it is called 'students'

## Add PRIMARY KEY when creating table

In [19]:
#The primary key is an integer which auto increase from 1 to infinity
new_cursor.execute('CREATE TABLE clients (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), code VARCHAR(255))')

## Add PRIMARY KEY if table already exists

In [20]:
new_cursor.execute('ALTER TABLE students ADD COLUMN id INT AUTO_INCREMENT PRIMARY KEY')

## Inserting data into tables

In [24]:
new_sql = 'INSERT INTO students (name, code) VALUES (%s, %s)'
#(%s, %s) are placeholders
new_vals = ('Ronaldo', 'CODE12')

new_cursor.execute(new_sql, new_vals)
#commit allows changes to be made
new_db.commit()

print(new_cursor.rowcount, 'new record inserted')

1 new record inserted

## Inserting many records into table

In [25]:
new_vals = (
    ('Messi', 'CODE10'),
    ('Pogba', 'CODE06'),
    ('Salah', 'CODE11'),
    ('Someone', 'CODE110')
)

new_cursor.executemany(new_sql, new_vals)
new_db.commit()
print(new_cursor.rowcount, 'records inserted')

4 records inserted

## Select Table's data

In [26]:
#the asteriks means all, so select all
new_cursor.execute('SELECT * FROM students')
new_data = new_cursor.fetchall()

for x in new_data:
    print(x)

('Ronaldo', 'CODE12', 1)
('Messi', 'CODE10', 2)
('Pogba', 'CODE06', 3)
('Salah', 'CODE11', 4)
('Someone', 'CODE110', 5)

## Select data from columns

In [27]:
#select name and code from database name students
new_cursor.execute('SELECT name, code FROM students')
new_data = new_cursor.fetchall()

for x in new_data:
    print(x)

('Ronaldo', 'CODE12')
('Messi', 'CODE10')
('Pogba', 'CODE06')
('Salah', 'CODE11')
('Someone', 'CODE110')

In [28]:
#select name from database name students
new_cursor.execute('SELECT name FROM students')
new_data = new_cursor.fetchall()

for x in new_data:
    print(x)

('Ronaldo',)
('Messi',)
('Pogba',)
('Salah',)
('Someone',)

In [29]:
print(new_data)

[('Ronaldo',), ('Messi',), ('Pogba',), ('Salah',), ('Someone',)]

## Select only a single row

In [30]:
new_cursor.execute('SELECT * FROM students')
#fetches the first record in the student table
new_data = new_cursor.fetchone()
print(new_data)

('Ronaldo', 'CODE12', 1)

## Filter the result

In [37]:
#we want to select only records that have Ronaldo 
#as a value in the name column
new_db = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = 'gateway666',
    database = 'newdata'
)

new_cursor = new_db.cursor()

#filter name
new_sql = "SELECT * FROM students WHERE name = 'Ronaldo'"
new_cursor.execute(new_sql)
new_data = new_cursor.fetchall()

for x in new_data:
    print(x)

('Ronaldo', 'CODE12', 1)

In [38]:
#filter code
new_sql = "SELECT * FROM students WHERE code = 'CODE06'"
new_cursor.execute(new_sql)
new_data = new_cursor.fetchall()

for x in new_data:
    print(x)

('Pogba', 'CODE06', 3)

## Wildcard characters

In [39]:
#filter code
new_sql = "SELECT * FROM students WHERE name LIKE '%messi%'"
new_cursor.execute(new_sql)
new_data = new_cursor.fetchall()

for x in new_data:
    print(x)

('Messi', 'CODE10', 2)

## Sorting results

In [40]:
#ascending order of names
new_sql = 'Select * FROM students ORDER BY name'
new_cursor.execute(new_sql)
new_data = new_cursor.fetchall()

for x in new_data:
    print(x)

('Messi', 'CODE10', 2)
('Pogba', 'CODE06', 3)
('Ronaldo', 'CODE12', 1)
('Salah', 'CODE11', 4)
('Someone', 'CODE110', 5)

In [42]:
#descending order of codes
new_sql = 'Select * FROM students ORDER BY code DESC'
new_cursor.execute(new_sql)
new_data = new_cursor.fetchall()

for x in new_data:
    print(x)

('Ronaldo', 'CODE12', 1)
('Someone', 'CODE110', 5)
('Salah', 'CODE11', 4)
('Messi', 'CODE10', 2)
('Pogba', 'CODE06', 3)

## Delect records

In [48]:
new_sql = 'DELETE FROM students WHERE name = %s'
name = ('Messi',)
#this format instead of inserting name into new_sql var 
#prevents injections in python

new_cursor.execute(new_sql, name)
new_db.commit()

print(new_cursor.rowcount, 'records deleted from newdata')

1 records deleted from newdata

## Deleting table

In [50]:
#the table name clients is deleted
#use if exit statement to prevent getting an error should
#the code be run twice

new_sql = 'DROP TABLE IF EXISTS clients'
new_cursor.execute(new_sql)

## Updating table

In [59]:
new_sql = "UPDATE students SET code = %s WHERE code = %s"
new_vals = ('CODE12', 'CODE07')
new_cursor.execute(new_sql, new_vals)
new_db.commit()
print(new_cursor.rowcount, 'records changed in students table!')

1 records changed in students table!

## Limit the records

In [60]:
#select first 4 records from the batabase
new_sql = 'SELECT * FROM students LIMIT 4'
new_cursor.execute(new_sql)

new_data = new_cursor.fetchall()
for x in new_data:
    print(x)

('Ronaldo', 'CODE12', 1)
('Pogba', 'CODE06', 3)
('Salah', 'CODE11', 4)
('Someone', 'CODE110', 5)

In [61]:
# select 2 records after the first 2 records
new_sql = 'SELECT * FROM students LIMIT 2 OFFSET 2'
new_cursor.execute(new_sql)

new_data = new_cursor.fetchall()
for x in new_data:
    print(x)

('Salah', 'CODE11', 4)
('Someone', 'CODE110', 5)